views/layouts/main.php

function getMenus($locale = 'fr')
{

$list = Menu::find()->where(['actif' => '1'])->orderBy(['position' => SORT_ASC])->all();
---
SELECT * FROM `menu` WHERE `actif`='1' ORDER BY `position`

function getIdParTitreFR($titreFR)
{
	$rubrique = Menu::find()->where(['titre_fr' => $titreFR])->one();
---
SELECT * FROM `menu` WHERE `titre_fr`='Accueil'

function getIdParTitreEN($titreEN)
{
	$rubrique = Menu::find()->where(['titre_en' => $titreEN])->one();
---
SELECT * FROM `menu` WHERE `titre_en`='Home'