controllers/PublicationController.php

    protected function findModel($id)
    {
        if (($model = Publication::findOne($id)) !== null) {
---
SELECT * FROM `publication` WHERE `ID`='82'

    public function uploadBibtex($fichier)
    {
            // On récupère les données
            $uploadfile = 'uploads/bibtex/'.$fichier;
            // On déplace le fichier dans le dossier d'upload
            if (file_exists($uploadfile))
            {
                // On charge le fichier bibtex
                $bibtex = new Structures_BibTex_Core();
                $ret = $bibtex->loadFile($uploadfile);


                // On parse le fichier bibtex afin de remplir la structure.
                $bibtex->parse();

                $model = new Publication();
                foreach ($bibtex->data as $datas)
                {
                    // On créé un objet Publication à partir des données bibtex
                    $model = $this->mappingBibtex($datas);
                    $model->save();
---
INSERT INTO `publication` (`ID`, `reference`, `auteurs`, `titre`, `date`, `journal`, `volume`, `number`, `pages`, `note`, `abstract`, `keywords`, `series`, `localite`, `publisher`, `editor`, `pdf`, `date_display`, `categorie_id`) VALUES (NULL, 'SCZ12', 'moi', 'test', '2013-01-01', '', '', '', '', '', '', '', '', '', '', '', NULL, '2014-11-25', 4)