controllers/PublicationController.php

SELECT * FROM `publication` WHERE `ID`='5'
---
    protected function findModel($id)
    {
        if (($model = Publication::findOne($id)) !== null) {