controllers/RubriquesController.php

    protected static function findModel($id)
    {
        if (($model = Rubrique::findOne($id)) !== null) {
---
SELECT * FROM `rubrique` WHERE `id`='66'