views/publication/_form.php


    <?= $form->field($model, 'date_display')->textarea(['rows' => 6]) ?>

    <?= Html::activeDropDownList($model, 'categorie_id', ArrayHelper::map(Categorie::find()->all(), 'ID','name_fr')); ?>
---
SELECT * FROM `categorie`