views/site/fonctions_tri_publi.php

SELECT * FROM `categorie`
---
function getCategories()
{
	$list = Categorie::find()->all();

SELECT * FROM `categorie` WHERE `ID`=1
---
function getCategoriePubli($id)
{
	$cat= Categorie::find()->where(['ID' => $id])->one();

SELECT * FROM `publication` WHERE `categorie_id`=1 ORDER BY `categorie_id` DESC
---
function getPubliByCateg($idCateg)
{
	$list = Publication::find()->where(['categorie_id' => $idCateg])->all();