views/site/index.php

SELECT * FROM `rubrique`
---
if (isset($_GET["page"])) {
    $idPage = $_GET["page"];
}
$rubrique = Rubrique::find()->one();

SELECT * FROM `rubrique` WHERE `menu_id`='2'
---
function getRubriqueParid($id, $locale = 'fr')
{

$rubrique = Rubrique::find()->where(['menu_id' => $id])->one();