views/site/publications.php

function getPublications()
{
$list = Publication::find()->orderBy(['date' => SORT_DESC])->all();
---
SELECT * FROM `publication` ORDER BY `date` DESC