models/RubriquesSearch.php

SELECT COUNT(*) FROM `rubrique`
---
    public function pagination()
    {
		$query = Rubrique::find();

        $pagination = new Pagination([
            'defaultPageSize' => 5,
            'totalCount' => $query->count(),